bzdsm99/STM32L431RC6-hal/Hardware/Src/OLED.c
//OLED.c
#include "stm32l4xx_hal.h"
#include "OLED.h"
#include <string.h>
#include <math.h>
#include <stdio.h>
#include <stdarg.h>

/**
  * 数据存储格式：
  * 纵向8点，高位在下，先从左到右，再从上到下
  * 每一个Bit对应一个像素点
  * 
  *      B0 B0                  B0 B0
  *      B1 B1                  B1 B1
  *      B2 B2                  B2 B2
  *      B3 B3  ------------->  B3 B3 --
  *      B4 B4                  B4 B4  |
  *      B5 B5                  B5 B5  |
  *      B6 B6                  B6 B6  |
  *      B7 B7                  B7 B7  |
  *                                    |
  *  -----------------------------------
  *  |   
  *  |   B0 B0                  B0 B0
  *  |   B1 B1                  B1 B1
  *  |   B2 B2                  B2 B2
  *  --> B3 B3  ------------->  B3 B3
  *      B4 B4                  B4 B4
  *      B5 B5                  B5 B5
  *      B6 B6                  B6 B6
  *      B7 B7                  B7 B7
  * 
  * 坐标轴定义：
  * 左上角为(0, 0)点
  * 横向向右为X轴，取值范围：0~127
  * 纵向向下为Y轴，取值范围：0~63
  * 
  *       0             X轴           127 
  *      .------------------------------->
  *    0 |
  *      |
  *      |
  *      |
  *  Y轴 |
  *      |
  *      |
  *      |
  *   63 |
  *      v
  * 
  */


// OLED I2C地址
#define OLED_ADDRESS 0x78

#ifdef OLED_USE_Hardware
    // I2C句柄定义
    #if (I2C_PERIPH == 1)
        I2C_HandleTypeDef hi2c1;
        #define OLED_I2C_HANDLE hi2c1
    #elif (I2C_PERIPH == 2)
        I2C_HandleTypeDef hi2c2;
        #define OLED_I2C_HANDLE hi2c2
    #elif (I2C_PERIPH == 3)
        I2C_HandleTypeDef hi2c3;
        #define OLED_I2C_HANDLE hi2c3
    #elif (I2C_PERIPH == 4)
        I2C_HandleTypeDef hi2c4;
        #define OLED_I2C_HANDLE hi2c4
    #else
        #error "请在OLED.h中定义正确的I2C接口"
    #endif
#endif



#ifdef Using_Video_Memory
	/**
	 * OLED显存数组
	 * 所有的显示函数，都只是对此显存数组进行读写
	 * 随后调用OLED_Update函数或OLED_UpdateArea函数
	 * 才会将显存数组的数据发送到OLED硬件，进行显示
	 */
	uint8_t OLED_DisplayBuf[8][128];
#endif

// 使用硬件I2C
#ifdef OLED_USE_Hardware
	#include "sys.h"
	/**
	 * @brief：针对STM32L431的硬件I2C配置
	 * @param：无
	 * @retval：无
	 */
	void OLED_GPIO_Init(void)
	{
		// 配置I2C引脚
		GPIO_InitTypeDef GPIO_InitStruct = {0};
		
		// 根据选择的I2C接口配置相应的引脚
		#if (I2C_PERIPH == 1)
			// 启用I2C1时钟和相关GPIO时钟
			__HAL_RCC_I2C1_CLK_ENABLE();
			__HAL_RCC_GPIOA_CLK_ENABLE();
			
			// PA9 (SCL) 和 PA10 (SDA) 配置成"复用开漏"模式
			GPIO_InitStruct.Pin = GPIO_PIN_9 | GPIO_PIN_10;
			GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
			GPIO_InitStruct.Pull = GPIO_PULLUP;
			GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
			GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
			HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
			
			// 初始化I2C1外设
			OLED_I2C_HANDLE.Instance = I2C1;
			OLED_I2C_HANDLE.Init.Timing = 0x10909CEC;  // 从STM32CubeMX生成的值
			OLED_I2C_HANDLE.Init.OwnAddress1 = 0;
			OLED_I2C_HANDLE.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
			OLED_I2C_HANDLE.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
			OLED_I2C_HANDLE.Init.OwnAddress2 = 0;
			OLED_I2C_HANDLE.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
			OLED_I2C_HANDLE.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
			OLED_I2C_HANDLE.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
			if (HAL_I2C_Init(&OLED_I2C_HANDLE) != HAL_OK)
			{
				Error_Handler();
			}
			
			// 配置模拟滤波器
			if (HAL_I2CEx_ConfigAnalogFilter(&OLED_I2C_HANDLE, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
			{
				Error_Handler();
			}
			
			// 配置数字滤波器
			if (HAL_I2CEx_ConfigDigitalFilter(&OLED_I2C_HANDLE, 0) != HAL_OK)
			{
				Error_Handler();
			}
		#elif (I2C_PERIPH == 2)
			__HAL_RCC_I2C2_CLK_ENABLE();
			__HAL_RCC_GPIOB_CLK_ENABLE();
			GPIO_InitStruct.Pin = GPIO_PIN_10 | GPIO_PIN_11;
			GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
			GPIO_InitStruct.Pull = GPIO_PULLUP;
			GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
			GPIO_InitStruct.Alternate = GPIO_AF4_I2C2;
			HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
			
			// 初始化I2C2外设
			OLED_I2C_HANDLE.Instance = I2C2;
			OLED_I2C_HANDLE.Init.Timing = 0x10909CEC;
			OLED_I2C_HANDLE.Init.OwnAddress1 = 0;
			OLED_I2C_HANDLE.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
			OLED_I2C_HANDLE.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
			OLED_I2C_HANDLE.Init.OwnAddress2 = 0;
			OLED_I2C_HANDLE.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
			OLED_I2C_HANDLE.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
			OLED_I2C_HANDLE.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
			if (HAL_I2C_Init(&OLED_I2C_HANDLE) != HAL_OK)
			{
				Error_Handler();
			}
			
			if (HAL_I2CEx_ConfigAnalogFilter(&OLED_I2C_HANDLE, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
			{
				Error_Handler();
			}
			
			if (HAL_I2CEx_ConfigDigitalFilter(&OLED_I2C_HANDLE, 0) != HAL_OK)
			{
				Error_Handler();
			}
		#elif (I2C_PERIPH == 3)
			// I2C3 使用 PC0 (SCL) 和 PC1 (SDA)
			__HAL_RCC_I2C3_CLK_ENABLE();
			__HAL_RCC_GPIOC_CLK_ENABLE();
			
			// 配置 SCL (PC0)
			GPIO_InitStruct.Pin = GPIO_PIN_0;
			GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
			GPIO_InitStruct.Pull = GPIO_PULLUP;
			GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
			GPIO_InitStruct.Alternate = GPIO_AF4_I2C3;
			HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
			
			// 配置 SDA (PC1)
			GPIO_InitStruct.Pin = GPIO_PIN_1;
			HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
			
			// 初始化I2C3外设
			OLED_I2C_HANDLE.Instance = I2C3;
			OLED_I2C_HANDLE.Init.Timing = 0x10909CEC;
			OLED_I2C_HANDLE.Init.OwnAddress1 = 0;
			OLED_I2C_HANDLE.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
			OLED_I2C_HANDLE.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
			OLED_I2C_HANDLE.Init.OwnAddress2 = 0;
			OLED_I2C_HANDLE.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
			OLED_I2C_HANDLE.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
			OLED_I2C_HANDLE.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
			if (HAL_I2C_Init(&OLED_I2C_HANDLE) != HAL_OK)
			{
				Error_Handler();
			}
			
			if (HAL_I2CEx_ConfigAnalogFilter(&OLED_I2C_HANDLE, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
			{
				Error_Handler();
			}
			
			if (HAL_I2CEx_ConfigDigitalFilter(&OLED_I2C_HANDLE, 0) != HAL_OK)
			{
				Error_Handler();
			}
		#endif
	}

	/**
	 * @brief：I2C接收一个字节
	 * @param：RegAddress 要读取的寄存器地址
	 * @retval：接收到的数据
	 */
	uint8_t OLED_I2C_ReceiverByte(uint8_t RegAddress)
	{
		uint8_t Data;
		// 使用HAL库函数读取数据
		HAL_I2C_Master_Receive(&OLED_I2C_HANDLE, OLED_ADDRESS, &Data, 1, 100);
		return Data;		
	}

#else
	// 使用软件I2C实现
	// 软件I2C引脚操作宏定义
	#define OLED_SCL_HIGH()  do { OLED_SCL_PORT->BSRR = OLED_SCL_PIN; } while(0)
	#define OLED_SCL_LOW()   do { OLED_SCL_PORT->BRR  = OLED_SCL_PIN; } while(0)
	#define OLED_SDA_HIGH()  do { OLED_SDA_PORT->BSRR = OLED_SDA_PIN; } while(0)
	#define OLED_SDA_LOW()   do { OLED_SDA_PORT->BRR  = OLED_SDA_PIN; } while(0)
	#define OLED_SDA_READ()  ((OLED_SDA_PORT->IDR & OLED_SDA_PIN) ? 1U : 0U)
	
    void OLED_GPIO_Init(void)
	{
		 GPIO_InitTypeDef GPIO_InitStruct = {0};
        
