bzdsm99/STM32L431RC6-hal/Hardware/Src/OLED.c
        // 使能GPIOA时钟
        __HAL_RCC_GPIOA_CLK_ENABLE();
        
        // 配置SCL和SDA引脚
        GPIO_InitStruct.Pin = OLED_SCL_PIN;
        GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;  // 开漏输出
        GPIO_InitStruct.Pull = GPIO_PULLUP;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
        HAL_GPIO_Init(OLED_SCL_PORT, &GPIO_InitStruct);
        GPIO_InitStruct.Pin = OLED_SDA_PIN;
		HAL_GPIO_Init(OLED_SDA_PORT, &GPIO_InitStruct);

        // 初始化引脚为高电平
        OLED_SCL_HIGH();
        OLED_SDA_HIGH();
	}

	static void OLED_Delay(void) {
		for (volatile int i = 0; i < 20; i++);
	}
    
	/**
      * @brief  OLED软件I2C起始信号
      * @param  无
      * @retval 无
      */
    void OLED_I2C_Start(void)
    {
        OLED_SDA_HIGH();
        OLED_SCL_HIGH();
        OLED_Delay();
        OLED_SDA_LOW();
        OLED_Delay();
        OLED_SCL_LOW();
    }

    /**
      * @brief  OLED软件I2C停止信号
      * @param  无
      * @retval 无
      */
    void OLED_I2C_Stop(void)
    {
        OLED_SCL_LOW();
        OLED_SDA_LOW();
        OLED_Delay();
        OLED_SCL_HIGH();
        OLED_Delay();
        OLED_SDA_HIGH();
    }

    /**
      * @brief  OLED软件I2C发送一个字节
      * @param  Byte 要发送的字节
      * @retval 无
      */
    void OLED_I2C_SendByte(uint8_t Byte)
    {
        uint8_t i;
        OLED_SCL_LOW(); // 确保在发送数据前时钟线为低
        
        for (i = 0; i < 8; i++)
        {
            if (Byte & 0x80)
            {
                OLED_SDA_HIGH();
            }
            else
            {
                OLED_SDA_LOW();
            }
            OLED_Delay();
            OLED_SCL_HIGH();
            OLED_Delay();
            OLED_SCL_LOW();
            if (i == 7)
            {
                OLED_SDA_HIGH(); // 释放SDA线，准备接收ACK
            }
            Byte <<= 1;
            OLED_Delay();
        }
        
        // 接收ACK
        OLED_SCL_HIGH();
        OLED_Delay();
        OLED_SCL_LOW();
        OLED_Delay();
    }
#endif // OLED_USE_Hardware


/**
  * @brief  OLED写命令
  * @param  Command 要写入的命令值，范围：0x00~0xFF
  * @retval 无
  */
void OLED_WriteCommand(uint8_t Command)
{
#ifndef OLED_USE_Hardware
    OLED_I2C_Start();
    OLED_I2C_SendByte(OLED_ADDRESS);      // 发送设备地址
    OLED_I2C_SendByte(0x00);              // 控制字节，0x00表示命令
    OLED_I2C_SendByte(Command);           // 发送命令
    OLED_I2C_Stop();
#else
    uint8_t data[2] = {0x00, Command};
    HAL_I2C_Master_Transmit(&OLED_I2C_HANDLE, OLED_ADDRESS, data, 2, 100);
#endif
}

/**
  * @brief  OLED写数据
  * @param  Data 要写入的数据
  * @retval 无
  */
void OLED_WriteData(uint8_t Data)
{
#ifndef OLED_USE_Hardware
    OLED_I2C_Start();
    OLED_I2C_SendByte(OLED_ADDRESS);      // 发送设备地址
    OLED_I2C_SendByte(0x40);              // 控制字节，0x40表示数据
    OLED_I2C_SendByte(Data);              // 发送数据
    OLED_I2C_Stop();
#else
    uint8_t data[2] = {0x40, Data};
    HAL_I2C_Master_Transmit(&OLED_I2C_HANDLE, OLED_ADDRESS, data, 2, 100);
#endif
}


/**
  * @brief  OLED初始化
  * @param  无
  * @retval 无
  */
void OLED_Init(void)
{
	uint8_t i, j;

	for (i = 0; i < 100; i++)			//上电延时
	{
		for (j = 0; j < 100; j++);
	}

	OLED_GPIO_Init();			//端口初始化

	OLED_WriteCommand(0xAE);	//关闭显示
	
	OLED_WriteCommand(0xD5);	//设置显示时钟分频比/振荡器频率
	OLED_WriteCommand(0x80);
	
	OLED_WriteCommand(0xA8);	//设置多路复用率
	OLED_WriteCommand(0x3F);
	
	OLED_WriteCommand(0xD3);	//设置显示偏移
	OLED_WriteCommand(0x00);
	
	OLED_WriteCommand(0x40);	//设置显示开始行
	
	OLED_WriteCommand(0xA1);	//设置左右方向，0xA1正常 0xA0左右反置
	
	OLED_WriteCommand(0xC8);	//设置上下方向，0xC8正常 0xC0上下反置

	OLED_WriteCommand(0xDA);	//设置COM引脚硬件配置
	OLED_WriteCommand(0x12);
	
	OLED_WriteCommand(0x81);	//设置对比度控制
	OLED_WriteCommand(0xCF);

	OLED_WriteCommand(0xD9);	//设置预充电周期
	OLED_WriteCommand(0xF1);

	OLED_WriteCommand(0xDB);	//设置VCOMH取消选择级别
	OLED_WriteCommand(0x30);

	OLED_WriteCommand(0xA4);	//设置整个显示打开/关闭

	OLED_WriteCommand(0xA6);	//设置正常/倒转显示

	OLED_WriteCommand(0x8D);	//设置充电泵
	OLED_WriteCommand(0x14);

	OLED_WriteCommand(0xAF);	//开启显示
		
	OLED_Clear();				//OLED清屏
	#ifdef Using_Video_Memory
		OLED_Update();				//更新显示，清屏，防止初始化后未显示内容时花屏
	#endif
}
	
	
/**
  * @brief：OLED设置显示光标位置
  * @param：Page 指定光标所在的页，范围：0~7
  * @param：X 指定光标所在的X轴坐标，范围：0~127
  * @retval：无
  * @note：OLED默认的Y轴，只能8个Bit为一组写入，即1页等于8个Y轴坐标
  */
void OLED_SetCursor(uint8_t Page, uint8_t X)
{
	/*如果使用此程序驱动1.3寸的OLED显示屏，则需要解除此注释*/
	/*因为1.3寸的OLED驱动芯片（SH1106）有132列*/
	/*屏幕的起始列接在了第2列，而不是第0列*/
	/*所以需要将X加2，才能正常显示*/
	#ifdef Drive_SH1106
		X += 2;
	#endif
	
	/*通过指令设置页地址和列地址*/
	OLED_WriteCommand(0xB0 | Page);					//设置页位置
	OLED_WriteCommand(0x10 | ((X & 0xF0) >> 4));	//设置X位置高4位
	OLED_WriteCommand(0x00 | (X & 0x0F));			//设置X位置低4位
}




/**
  * @brief  OLED次方函数
  * @retval 返回值等于X的Y次方
  */
uint32_t OLED_Pow(uint32_t X, uint32_t Y)
{
	uint32_t Result = 1;	//结果默认为1
	while (Y--)
	{
		Result *= X;		//累乘Y次
	}
	return Result;			//每次把X累乘到结果上
}



#ifdef Using_Video_Memory
	/**
	  * @brief：判断指定点是否在指定多边形内部
	  * @param：nvert 多边形的顶点数
	  * @param：vertx verty 包含多边形顶点的x和y坐标的数组
	  * @param：testx testy 测试点的X和y坐标
	  * @retval：指定点是否在指定多边形内部，1：在内部，0：不在内部
	  */
	uint8_t OLED_pnpoly(uint8_t nvert, int16_t *vertx, int16_t *verty, int16_t testx, int16_t testy)
	{
		int16_t i, j, c = 0;
		
		/*此算法由W. Randolph Franklin提出*/
		/*参考链接：https://wrfranklin.org/Research/Short_Notes/pnpoly.html*/
		for (i = 0, j = nvert - 1; i < nvert; j = i++)
		{
			if (((verty[i] > testy) != (verty[j] > testy)) &&
				(testx < (vertx[j] - vertx[i]) * (testy - verty[i]) / (verty[j] - verty[i]) + vertx[i]))
			{
				c = !c;
			}
		}
		return c;
	}

	/**
	  * @brief：判断指定点是否在指定角度内部
	  * @param：X Y 指定点的坐标
	  * @param：StartAngle EndAngle 起始角度和终止角度，范围：-180~180
	  *           水平向右为0度，水平向左为180度或-180度，下方为正数，上方为负数，顺时针旋转
	  * @retval：指定点是否在指定角度内部，1：在内部，0：不在内部
	  */
	uint8_t OLED_IsInAngle(int16_t X, int16_t Y, int16_t StartAngle, int16_t EndAngle)
	{
		int16_t PointAngle;
		PointAngle = atan2(Y, X) / 3.14 * 180;	//计算指定点的弧度，并转换为角度表示
		if (StartAngle < EndAngle)	//起始角度小于终止角度的情况
		{
			/*如果指定角度在起始终止角度之间，则判定指定点在指定角度*/
			if (PointAngle >= StartAngle && PointAngle <= EndAngle)
			{
				return 1;
			}
		}
		else			//起始角度大于于终止角度的情况
		{
			/*如果指定角度大于起始角度或者小于终止角度，则判定指定点在指定角度*/
			if (PointAngle >= StartAngle || PointAngle <= EndAngle)
			{
				return 1;
			}
		}
		return 0;		//不满足以上条件，则判断判定指定点不在指定角度
	}


	/**
	  * @brief：将OLED显存数组更新到OLED屏幕
	  * @param：无
	  * @retval：无
	  * @note：所有的显示函数，都只是对OLED显存数组进行读写
	  *           随后调用OLED_Update函数或OLED_UpdateArea函数
	  *           才会将显存数组的数据发送到OLED硬件，进行显示
	  *           故调用显示函数后，要想真正地呈现在屏幕上，还需调用更新函数
	  */
	void OLED_Update(void)
	{
		uint8_t j;
		/*遍历每一页*/
		for (j = 0; j < 8; j ++)
		{
			/*设置光标位置为每一页的第一列*/
			OLED_SetCursor(j, 0);
			/*连续写入128个数据，将显存数组的数据写入到OLED硬件*/
			OLED_WriteData(OLED_DisplayBuf[j], 128);
		}
	}

	/**
	  * @brief：将OLED显存数组部分更新到OLED屏幕
	  * @param：X 指定区域左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
	  * @param：Y 指定区域左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
	  * @param：Width 指定区域的宽度，范围：0~128
	  * @param：Height 指定区域的高度，范围：0~64
	  * @retval：无
	  * @note：此函数会至少更新参数指定的区域
	  *           如果更新区域Y轴只包含部分页，则同一页的剩余部分会跟随一起更新
	  * @note：所有的显示函数，都只是对OLED显存数组进行读写
	  *           随后调用OLED_Update函数或OLED_UpdateArea函数
	  *           才会将显存数组的数据发送到OLED硬件，进行显示
	  *           故调用显示函数后，要想真正地呈现在屏幕上，还需调用更新函数
	  */
	void OLED_UpdateArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
	{
		int16_t j;
		int16_t Page, Page1;
		
		/*负数坐标在计算页地址时需要加一个偏移*/
		/*(Y + Height - 1) / 8 + 1的目的是(Y + Height) / 8并向上取整*/
		Page = Y / 8;
		Page1 = (Y + Height - 1) / 8 + 1;
		if (Y < 0)
		{
			Page -= 1;
			Page1 -= 1;
		}
		
		/*遍历指定区域涉及的相关页*/
		for (j = Page; j < Page1; j ++)
		{
			if (X >= 0 && X <= 127 && j >= 0 && j <= 7)		//超出屏幕的内容不显示
			{
				/*设置光标位置为相关页的指定列*/
				OLED_SetCursor(j, X);
				/*连续写入Width个数据，将显存数组的数据写入到OLED硬件*/
				OLED_WriteData(&OLED_DisplayBuf[j][X], Width);
			}
		}
	}

	/**
	  * @brief：将OLED显存数组全部清零
	  * @param：无
	  * @retval：无
	  * @note：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
	  */
	void OLED_Clear(void)
	{
		uint8_t i, j;
		for (j = 0; j < 8; j ++)				//遍历8页
		{
			for (i = 0; i < 128; i ++)			//遍历128列
			{
				OLED_DisplayBuf[j][i] = 0x00;	//将显存数组数据全部清零
			}
		}
	}

	/**
	  * @brief：将OLED显存数组部分清零
	  * @param：X 指定区域左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
	  * @param：Y 指定区域左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
	  * @param：Width 指定区域的宽度，范围：0~128
	  * @param：Height 指定区域的高度，范围：0~64
	  * @retval：无
	  * @note：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
	  */
	void OLED_ClearArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
	{
		int16_t i, j;
		
		for (j = Y; j < Y + Height; j ++)		//遍历指定页
		{
			for (i = X; i < X + Width; i ++)	//遍历指定列
			{
				if (i >= 0 && i <= 127 && j >=0 && j <= 63)				//超出屏幕的内容不显示
				{
					OLED_DisplayBuf[j / 8][i] &= ~(0x01 << (j % 8));	//将显存数组指定数据清零
				}
			}
		}
	}

	/**
	  * @brief：将OLED显存数组全部取反
	  * @param：无
	  * @retval：无
	  * @note：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
	  */
	void OLED_Reverse(void)
	{
		uint8_t i, j;
		for (j = 0; j < 8; j ++)				//遍历8页
		{
			for (i = 0; i < 128; i ++)			//遍历128列
			{
				OLED_DisplayBuf[j][i] ^= 0xFF;	//将显存数组数据全部取反
			}
		}
	}
		
	/**
	  * @brief：将OLED显存数组部分取反
	  * @param：X 指定区域左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
	  * @param：Y 指定区域左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
	  * @param：Width 指定区域的宽度，范围：0~128
	  * @param：Height 指定区域的高度，范围：0~64
	  * @retval：无
	  * @note：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
	  */
	void OLED_ReverseArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
	{
		int16_t i, j;
		
		for (j = Y; j < Y + Height; j ++)		//遍历指定页
		{
			for (i = X; i < X + Width; i ++)	//遍历指定列
			{
				if (i >= 0 && i <= 127 && j >=0 && j <= 63)			//超出屏幕的内容不显示
				{
					OLED_DisplayBuf[j / 8][i] ^= 0x01 << (j % 8);	//将显存数组指定数据取反
				}
			}
		}
	}

	/**
	  * @brief：OLED显示一个字符
	  * @param：X 指定字符左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
	  * @param：Y 指定字符左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
	  * @param：Char 指定要显示的字符，范围：ASCII码可见字符
	  * @param：FontSize 指定字体大小
	  *           范围：OLED_8X16		宽8像素，高16像素
	  *                 OLED_6X8		宽6像素，高8像素
	  * @retval：无
	  * @note：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
	  */
	void OLED_ShowChar(int16_t X, int16_t Y, char Char, uint8_t FontSize)
	{
		if (FontSize == OLED_8X16)		//字体为宽8像素，高16像素
		{
			/*将ASCII字模库OLED_F8x16的指定数据以8*16的图像格式显示*/
			OLED_ShowImage(X, Y, 8, 16, OLED_F8x16[Char - ' ']);
		}
		else if(FontSize == OLED_6X8)	//字体为宽6像素，高8像素
		{
			/*将ASCII字模库OLED_F6x8的指定数据以6*8的图像格式显示*/
			OLED_ShowImage(X, Y, 6, 8, OLED_F6x8[Char - ' ']);
		}
	}

	/**
	  * @brief：OLED显示字符串
	  * @param：X 指定字符串左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
	  * @param：Y 指定字符串左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
	  * @param：String 指定要显示的字符串，范围：ASCII码可见字符组成的字符串
	  * @param：FontSize 指定字体大小
	  *           范围：OLED_8X16		宽8像素，高16像素
	  *                 OLED_6X8		宽6像素，高8像素
	  * @retval：无
	  * @note：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
	  */
	void OLED_ShowString(int16_t X, int16_t Y, char *String, uint8_t FontSize)
	{
		uint8_t i;
		for (i = 0; String[i] != '\0'; i++)		//遍历字符串的每个字符
		{
			/*调用OLED_ShowChar函数，依次显示每个字符*/
			OLED_ShowChar(X + i * FontSize, Y, String[i], FontSize);
		}
	}

	/**
	  * @brief：OLED显示数字（十进制，正整数）
	  * @param：X 指定数字左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
	  * @param：Y 指定数字左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
	  * @param：Number 指定要显示的数字，范围：0~4294967295
	  * @param：Length 指定数字的长度，范围：0~10
	  * @param：FontSize 指定字体大小
	  *           范围：OLED_8X16		宽8像素，高16像素
	  *                 OLED_6X8		宽6像素，高8像素
	  * @retval：无
	  * @note：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
	  */
	void OLED_ShowNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
	{
		uint8_t i;
		for (i = 0; i < Length; i++)		//遍历数字的每一位							
		{
			/*调用OLED_ShowChar函数，依次显示每个数字*/
			/*Number / OLED_Pow(10, Length - i - 1) % 10 可以十进制提取数字的每一位*/
			/*+ '0' 可将数字转换为字符格式*/
			OLED_ShowChar(X + i * FontSize, Y, Number / OLED_Pow(10, Length - i - 1) % 10 + '0', FontSize);
		}
	}

	/**
	  * @brief：OLED显示有符号数字（十进制，整数）
	  * @param：X 指定数字左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
	  * @param：Y 指定数字左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
	  * @param：Number 指定要显示的数字，范围：-2147483648~2147483647
	  * @param：Length 指定数字的长度，范围：0~10
	  * @param：FontSize 指定字体大小
	  *           范围：OLED_8X16		宽8像素，高16像素
	  *                 OLED_6X8		宽6像素，高8像素
	  * @retval：无
	  * @note：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
	  */
	void OLED_ShowSignedNum(int16_t X, int16_t Y, int32_t Number, uint8_t Length, uint8_t FontSize)
	{
		uint8_t i;
		uint32_t Number1;
		
		if (Number >= 0)						//数字大于等于0
		{
			OLED_ShowChar(X, Y, '+', FontSize);	//显示+号
			Number1 = Number;					//Number1直接等于Number
		}
		else									//数字小于0
		{
			OLED_ShowChar(X, Y, '-', FontSize);	//显示-号
			Number1 = -Number;					//Number1等于Number取负
		}
		
		for (i = 0; i < Length; i++)			//遍历数字的每一位								
		{
			/*调用OLED_ShowChar函数，依次显示每个数字*/
			/*Number1 / OLED_Pow(10, Length - i - 1) % 10 可以十进制提取数字的每一位*/
			/*+ '0' 可将数字转换为字符格式*/
			OLED_ShowChar(X + (i + 1) * FontSize, Y, Number1 / OLED_Pow(10, Length - i - 1) % 10 + '0', FontSize);
		}
	}

	/**
	  * @brief：OLED显示十六进制数字（十六进制，正整数）
	  * @param：X 指定数字左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
	  * @param：Y 指定数字左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
	  * @param：Number 指定要显示的数字，范围：0x00000000~0xFFFFFFFF
	  * @param：Length 指定数字的长度，范围：0~8
	  * @param：FontSize 指定字体大小
	  *           范围：OLED_8X16		宽8像素，高16像素
	  *                 OLED_6X8		宽6像素，高8像素
	  * @retval：无
	  * @note：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
	  */
	void OLED_ShowHexNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
	{
		uint8_t i, SingleNumber;
		for (i = 0; i < Length; i++)		//遍历数字的每一位
		{
			/*以十六进制提取数字的每一位*/
			SingleNumber = Number / OLED_Pow(16, Length - i - 1) % 16;
			
			if (SingleNumber < 10)			//单个数字小于10
			{
				/*调用OLED_ShowChar函数，显示此数字*/
				/*+ '0' 可将数字转换为字符格式*/
				OLED_ShowChar(X + i * FontSize, Y, SingleNumber + '0', FontSize);
			}
			else							//单个数字大于10
			{
				/*调用OLED_ShowChar函数，显示此数字*/
				/*+ 'A' 可将数字转换为从A开始的十六进制字符*/
				OLED_ShowChar(X + i * FontSize, Y, SingleNumber - 10 + 'A', FontSize);
			}
		}
	}

	/**
	  * @brief：OLED显示二进制数字（二进制，正整数）
	  * @param：X 指定数字左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
	  * @param：Y 指定数字左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
	  * @param：Number 指定要显示的数字，范围：0x00000000~0xFFFFFFFF
	  * @param：Length 指定数字的长度，范围：0~16
	  * @param：FontSize 指定字体大小
	  *           范围：OLED_8X16		宽8像素，高16像素
	  *                 OLED_6X8		宽6像素，高8像素
	  * @retval：无
	  * @note：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
	  */
	void OLED_ShowBinNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
	{
		uint8_t i;
		for (i = 0; i < Length; i++)		//遍历数字的每一位	
		{
			/*调用OLED_ShowChar函数，依次显示每个数字*/
			/*Number / OLED_Pow(2, Length - i - 1) % 2 可以二进制提取数字的每一位*/
			/*+ '0' 可将数字转换为字符格式*/
			OLED_ShowChar(X + i * FontSize, Y, Number / OLED_Pow(2, Length - i - 1) % 2 + '0', FontSize);
		}
	}

	/**
	  * @brief：OLED显示浮点数字（十进制，小数）
	  * @param：X 指定数字左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
	  * @param：Y 指定数字左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
	  * @param：Number 指定要显示的数字，范围：-4294967295.0~4294967295.0
	  * @param：IntLength 指定数字的整数位长度，范围：0~10
	  * @param：FraLength 指定数字的小数位长度，范围：0~9，小数进行四舍五入显示
	  * @param：FontSize 指定字体大小
	  *           范围：OLED_8X16		宽8像素，高16像素
	  *                 OLED_6X8		宽6像素，高8像素
	  * @retval：无
	  * @note：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
	  */
	void OLED_ShowFloatNum(int16_t X, int16_t Y, double Number, uint8_t IntLength, uint8_t FraLength, uint8_t FontSize)
	{
		uint32_t PowNum, IntNum, FraNum;
		
		if (Number >= 0)						//数字大于等于0
		{
			OLED_ShowChar(X, Y, '+', FontSize);	//显示+号
		}
		else									//数字小于0
		{
			OLED_ShowChar(X, Y, '-', FontSize);	//显示-号
			Number = -Number;					//Number取负
		}
		
