bzdsm99/STM32L431RC6-hal/Hardware/Src/OLED.c
		x = 0;
		y = b;
		d1 = b * b + a * a * (-b + 0.5);
		
		if (IsFilled)	//指定椭圆填充
		{
			/*遍历起始点Y坐标*/
			for (j = -y; j < y; j ++)
			{
				/*在指定区域画点，填充部分椭圆*/
				OLED_DrawPoint(X, Y + j);
				OLED_DrawPoint(X, Y + j);
			}
		}
		
		/*画椭圆弧的起始点*/
		OLED_DrawPoint(X + x, Y + y);
		OLED_DrawPoint(X - x, Y - y);
		OLED_DrawPoint(X - x, Y + y);
		OLED_DrawPoint(X + x, Y - y);
		
		/*画椭圆中间部分*/
		while (b * b * (x + 1) < a * a * (y - 0.5))
		{
			if (d1 <= 0)		//下一个点在当前点东方
			{
				d1 += b * b * (2 * x + 3);
			}
			else				//下一个点在当前点东南方
			{
				d1 += b * b * (2 * x + 3) + a * a * (-2 * y + 2);
				y --;
			}
			x ++;
			
			if (IsFilled)	//指定椭圆填充
			{
				/*遍历中间部分*/
				for (j = -y; j < y; j ++)
				{
					/*在指定区域画点，填充部分椭圆*/
					OLED_DrawPoint(X + x, Y + j);
					OLED_DrawPoint(X - x, Y + j);
				}
			}
			
			/*画椭圆中间部分圆弧*/
			OLED_DrawPoint(X + x, Y + y);
			OLED_DrawPoint(X - x, Y - y);
			OLED_DrawPoint(X - x, Y + y);
			OLED_DrawPoint(X + x, Y - y);
		}
		
		/*画椭圆两侧部分*/
		d2 = b * b * (x + 0.5) * (x + 0.5) + a * a * (y - 1) * (y - 1) - a * a * b * b;
		
		while (y > 0)
		{
			if (d2 <= 0)		//下一个点在当前点东方
			{
				d2 += b * b * (2 * x + 2) + a * a * (-2 * y + 3);
				x ++;
				
			}
			else				//下一个点在当前点东南方
			{
				d2 += a * a * (-2 * y + 3);
			}
			y --;
			
			if (IsFilled)	//指定椭圆填充
			{
				/*遍历两侧部分*/
				for (j = -y; j < y; j ++)
				{
					/*在指定区域画点，填充部分椭圆*/
					OLED_DrawPoint(X + x, Y + j);
					OLED_DrawPoint(X - x, Y + j);
				}
			}
			
			/*画椭圆两侧部分圆弧*/
			OLED_DrawPoint(X + x, Y + y);
			OLED_DrawPoint(X - x, Y - y);
			OLED_DrawPoint(X - x, Y + y);
			OLED_DrawPoint(X + x, Y - y);
		}
	}

	/**
	  * @brief：OLED画圆弧
	  * @param：X 指定圆弧的圆心横坐标，范围：-32768~32767，屏幕区域：0~127
	  * @param：Y 指定圆弧的圆心纵坐标，范围：-32768~32767，屏幕区域：0~63
	  * @param：Radius 指定圆弧的半径，范围：0~255
	  * @param：StartAngle 指定圆弧的起始角度，范围：-180~180
	  *           水平向右为0度，水平向左为180度或-180度，下方为正数，上方为负数，顺时针旋转
	  * @param：EndAngle 指定圆弧的终止角度，范围：-180~180
	  *           水平向右为0度，水平向左为180度或-180度，下方为正数，上方为负数，顺时针旋转
	  * @param：IsFilled 指定圆弧是否填充，填充后为扇形
	  *           范围：OLED_UNFILLED		不填充
	  *                 OLED_FILLED			填充
	  * @retval：无
	  * @note：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
	  */
	void OLED_DrawArc(int16_t X, int16_t Y, uint8_t Radius, int16_t StartAngle, int16_t EndAngle, uint8_t IsFilled)
	{
		int16_t x, y, d, j;
		
		/*此函数借用Bresenham算法画圆的方法*/
		
		d = 1 - Radius;
		x = 0;
		y = Radius;
		
		/*在画圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理*/
		if (OLED_IsInAngle(x, y, StartAngle, EndAngle))	{OLED_DrawPoint(X + x, Y + y);}
		if (OLED_IsInAngle(-x, -y, StartAngle, EndAngle)) {OLED_DrawPoint(X - x, Y - y);}
		if (OLED_IsInAngle(y, x, StartAngle, EndAngle)) {OLED_DrawPoint(X + y, Y + x);}
		if (OLED_IsInAngle(-y, -x, StartAngle, EndAngle)) {OLED_DrawPoint(X - y, Y - x);}
		
		if (IsFilled)	//指定圆弧填充
		{
			/*遍历起始点Y坐标*/
			for (j = -y; j < y; j ++)
			{
				/*在填充圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理*/
				if (OLED_IsInAngle(0, j, StartAngle, EndAngle)) {OLED_DrawPoint(X, Y + j);}
			}
		}
		
		while (x < y)		//遍历X轴的每个点
		{
			x ++;
			if (d < 0)		//下一个点在当前点东方
			{
				d += 2 * x + 1;
			}
			else			//下一个点在当前点东南方
			{
				y --;
				d += 2 * (x - y) + 1;
			}
			
			/*在画圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理*/
			if (OLED_IsInAngle(x, y, StartAngle, EndAngle)) {OLED_DrawPoint(X + x, Y + y);}
			if (OLED_IsInAngle(y, x, StartAngle, EndAngle)) {OLED_DrawPoint(X + y, Y + x);}
			if (OLED_IsInAngle(-x, -y, StartAngle, EndAngle)) {OLED_DrawPoint(X - x, Y - y);}
			if (OLED_IsInAngle(-y, -x, StartAngle, EndAngle)) {OLED_DrawPoint(X - y, Y - x);}
			if (OLED_IsInAngle(x, -y, StartAngle, EndAngle)) {OLED_DrawPoint(X + x, Y - y);}
			if (OLED_IsInAngle(y, -x, StartAngle, EndAngle)) {OLED_DrawPoint(X + y, Y - x);}
			if (OLED_IsInAngle(-x, y, StartAngle, EndAngle)) {OLED_DrawPoint(X - x, Y + y);}
			if (OLED_IsInAngle(-y, x, StartAngle, EndAngle)) {OLED_DrawPoint(X - y, Y + x);}
			
			if (IsFilled)	//指定圆弧填充
			{
				/*遍历中间部分*/
				for (j = -y; j < y; j ++)
				{
					/*在填充圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理*/
					if (OLED_IsInAngle(x, j, StartAngle, EndAngle)) {OLED_DrawPoint(X + x, Y + j);}
					if (OLED_IsInAngle(-x, j, StartAngle, EndAngle)) {OLED_DrawPoint(X - x, Y + j);}
				}
				
				/*遍历两侧部分*/
				for (j = -x; j < x; j ++)
				{
					/*在填充圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理*/
					if (OLED_IsInAngle(-y, j, StartAngle, EndAngle)) {OLED_DrawPoint(X - y, Y + j);}
					if (OLED_IsInAngle(y, j, StartAngle, EndAngle)) {OLED_DrawPoint(X + y, Y + j);}
				}
			}
		}
	}
#else

	/**
	  * @brief  OLED清屏
	  * @param  无
	  * @retval 无
	  */
	void OLED_Clear(void)
	{  
		uint8_t i, j;
		for (j = 0; j < 8; j++)
		{
			OLED_SetCursor(j, 0);
			for(i = 0; i < 128; i++)
			{
				OLED_WriteData(0x00);
			}
		}
	}

	/**
	  * @brief  OLED显示一个字符
	  * @param  Line 行位置，范围：1~4
	  * @param  Column 列位置，范围：1~16
	  * @param  Char 要显示的一个字符，范围：ASCII可见字符
	  * @retval 无
	  */
	void OLED_ShowChar(uint8_t Line, uint8_t Column, char Char)
	{      	
		uint8_t i;
		OLED_SetCursor((Line - 1) * 2, (Column - 1) * 8);		//设置光标位置在上半部分
		for (i = 0; i < 8; i++)
		{
			OLED_WriteData(OLED_F8x16[Char - ' '][i]);			//显示上半部分内容
		}
		OLED_SetCursor((Line - 1) * 2 + 1, (Column - 1) * 8);	//设置光标位置在下半部分
		for (i = 0; i < 8; i++)
		{
			OLED_WriteData(OLED_F8x16[Char - ' '][i + 8]);		//显示下半部分内容
		}
	}

	/**
	  * @brief  OLED显示字符串
	  * @param  Line 起始行位置，范围：1~4
	  * @param  Column 起始列位置，范围：1~16
	  * @param  String 要显示的字符串，范围：ASCII可见字符
	  * @retval 无
	  */
	void OLED_ShowString(uint8_t Line, uint8_t Column,const char *String)
	{
		uint8_t i;
		for (i = 0; String[i] != '\0'; i++)
		{
			OLED_ShowChar(Line, Column + i, String[i]);
		}
	}



	/**
	  * @brief  OLED显示数字（十进制，正数）
	  * @param  Line 起始行位置，范围：1~4
	  * @param  Column 起始列位置，范围：1~16
	  * @param  Number 要显示的数字，范围：0~4294967295
	  * @param  Length 要显示数字的长度，范围：1~10
	  * @retval 无
	  */
	void OLED_ShowNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
	{
		uint8_t i;
		for (i = 0; i < Length; i++)							
		{
			OLED_ShowChar(Line, Column + i, Number / OLED_Pow(10, Length - i - 1) % 10 + '0');
		}
	}

	/**
	  * @brief  OLED显示数字（十进制，带符号数）
	  * @param  Line 起始行位置，范围：1~4
	  * @param  Column 起始列位置，范围：1~16
	  * @param  Number 要显示的数字，范围：-2147483648~2147483647
	  * @param  Length 要显示数字的长度，范围：1~10
	  * @retval 无
	  */
	void OLED_ShowSignedNum(uint8_t Line, uint8_t Column, int32_t Number, uint8_t Length)
	{
		uint8_t i;
		uint32_t Number1;
		if (Number >= 0)
		{
			OLED_ShowChar(Line, Column, '+');
			Number1 = Number;
		}
		else
		{
			OLED_ShowChar(Line, Column, '-');
			Number1 = -Number;
		}
		for (i = 0; i < Length; i++)							
		{
			OLED_ShowChar(Line, Column + i + 1, Number1 / OLED_Pow(10, Length - i - 1) % 10 + '0');
		}
	}

	/**
	  * @brief  OLED显示数字（十六进制，正数）
	  * @param  Line 起始行位置，范围：1~4
	  * @param  Column 起始列位置，范围：1~16
	  * @param  Number 要显示的数字，范围：0~0xFFFFFFFF
	  * @param  Length 要显示数字的长度，范围：1~8
	  * @retval 无
	  */
	void OLED_ShowHexNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
	{
		uint8_t i, SingleNumber;
		for (i = 0; i < Length; i++)							
		{
			SingleNumber = Number / OLED_Pow(16, Length - i - 1) % 16;
			if (SingleNumber < 10)
			{
				OLED_ShowChar(Line, Column + i, SingleNumber + '0');
			}
			else
			{
				OLED_ShowChar(Line, Column + i, SingleNumber - 10 + 'A');
			}
		}
	}

	/**
	  * @brief  OLED显示数字（二进制，正数）
	  * @param  Line 起始行位置，范围：1~4
	  * @param  Column 起始列位置，范围：1~16
	  * @param  Number 要显示的数字，范围：0~1111 1111 1111 1111
	  * @param  Length 要显示数字的长度，范围：1~16
	  * @retval 无
	  */
	void OLED_ShowBinNum(uint8_t Line, uint8_t Column, uint32_t Number, uint8_t Length)
	{
		uint8_t i;
		for (i = 0; i < Length; i++)							
		{
			OLED_ShowChar(Line, Column + i, Number / OLED_Pow(2, Length - i - 1) % 2 + '0');
		}
	}

	/**
	  * @brief：OLED显示浮点数字（十进制，小数）
	  * @param：Line 行数 1-4
	  * @param：Column 列数 1-16
	  * @param：Number 指定要显示的数字，范围：-4294967295.0~4294967295.0
	  * @param：IntLength 指定数字的整数位长度，范围：0~10
	  * @param：FraLength 指定数字的小数位长度，范围：0~9，小数进行四舍五入显示
	  * @retval：无
	  */
	void OLED_ShowFloatNum(uint8_t Line, uint8_t Column, double Number, uint8_t IntLength, uint8_t FraLength)
	{
		uint32_t PowNum, IntNum, FraNum;
		
		if (Number >= 0)                        //数字大于等于0
		{
			OLED_ShowChar(Line, Column, '+');   //显示+号
		}
		else                                    //数字小于0
		{
			OLED_ShowChar(Line, Column, '-');   //显示-号
			Number = -Number;                   //Number取负
		}
		
