bzdsm99/STM32L431RC6-hal/Hardware/Src/OLED.c
		/*提取整数部分和小数部分*/
		IntNum = Number;                        //直接赋值给整型变量，提取整数
		Number -= IntNum;                       //将Number的整数减掉，防止之后将小数乘到整数时因数过大造成错误
		PowNum = OLED_Pow(10, FraLength);       //根据指定小数的位数，确定乘数
		FraNum = round(Number * PowNum);        //将小数乘到整数，同时四舍五入，避免显示误差
		IntNum += FraNum / PowNum;              //若四舍五入造成了进位，则需要再加给整数
		
		/*显示整数部分*/
		OLED_ShowNum(Line, Column + 1, IntNum, IntLength);
		/*显示小数点*/
		OLED_ShowChar(Line, Column + 1 + IntLength, '.');
		/*显示小数部分*/
		OLED_ShowNum(Line, Column + 1 + IntLength + 1, FraNum, FraLength);
	}

	/**
	  * @brief：OLED显示图像
	  * @param：X 指定图像左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
	  * @param：Page 指定图像左上角的横坐标从哪一页开始，范围：-32768~32767，屏幕区域：0~7
	  * @param：Width 指定图像的宽度，范围：0~128
	  * @param：Height 指定图像的高度，范围：0~64
	  * @param：Image 指定要显示的图像
	  * @retval：无
	  * @note：只能从某页的起始位置开始画
	  */
	void OLED_ShowImage(int16_t X, int16_t Page, uint8_t Width, uint8_t Height, const uint8_t *Image)
	{
		uint8_t i = 0, j = 0;
		for(j=0; j < Height/8; j++)
		{
			OLED_SetCursor((Page+j), X);
			for(i=0; i < Width; i++)
			{
				OLED_WriteData(Image[j * Width + i]);
			}
		}
		
		
	}


	/**
	  * @brief：OLED使用printf函数打印格式化字符串
	  * @param  Line 起始行位置，范围：1~4
	  * @param  Column 起始列位置，范围：1~16
	  * @param：format 指定要显示的格式化字符串，范围：ASCII码可见字符组成的字符串
	  * @param：... 格式化字符串参数列表
	  * @retval：无
	  */
	void OLED_Printf(uint8_t Line, uint8_t Column,const char *format, ...)
	{
		char String[256];						//定义字符数组
		va_list arg;							//定义可变参数列表数据类型的变量arg
		va_start(arg, format);					//从format开始，接收参数列表到arg变量
		vsprintf(String, format, arg);			//使用vsprintf打印格式化字符串和参数列表到字符数组中
		va_end(arg);							//结束变量arg
		OLED_ShowString(Line, Column, String);//OLED显示字符数组（字符串）
	}
	
#endif






